sofiia2002/fernando-levchenko-iot/STM32CubeExpansion_LRWAN_V2.1.0/Projects/B-L072Z-LRWAN1/Applications/LoRaWAN/LoRaWAN_End_Node/LoRaWAN/App/lora_app.c
    switch (appData->Port)
    {
      case LORAWAN_SWITCH_CLASS_PORT:
        /*this port switches the class*/
        if (appData->BufferSize == 1)
        {
          switch (appData->Buffer[0])
          {
            case 0:
            {
              LmHandlerRequestClass(CLASS_A);
              break;
            }
            case 1:
            {
              LmHandlerRequestClass(CLASS_B);
              break;
            }
            case 2:
            {
              LmHandlerRequestClass(CLASS_C);
              break;
            }
           default:
              break;
          }
        }
        break;
      case LORAWAN_USER_APP_PORT:
        if (appData->BufferSize == 1)
        {
          AppLedStateOn = appData->Buffer[0] & 0x01;
          if (AppLedStateOn == RESET)
          {
            APP_LOG(TS_OFF, VLEVEL_H,   "LED OFF\r\n");

            LED_Off(LED_RED1);
          }
          else
          {
            APP_LOG(TS_OFF, VLEVEL_H, "LED ON\r\n");

            LED_On(LED_RED1);
          }
        }
        break;
      case LORAWAN_RULE_MESS_PORT:

    	  // Processing received data
    	  buffer = appData->Buffer;
    	  rulesArray=nx_json_parse(buffer, 0);

    	  PressDataOn = 0;
    	  TempDataOn = 0;
    	  HumDataOn = 0;

    	  if (rulesArray) {

    		  for (i = 0; i < rulesArray->children.length; i++) {
    			  const nx_json* item=nx_json_item(rulesArray, i);
    			  parameter = (uint8_t)atoi(nx_json_get(item, "par") -> text_value);

    			  switch (parameter)
    			  {
    			  	  case TEMPERATURE:
    	    			  APP_LOG(TS_ON, VLEVEL_L, "ENABLING PARAMETER: TEMPERATURE\r\n");
    	    			  TempDataOn = 1;

    	    			  temperature_storage.AggMaxOn = 0;
    	    			  temperature_storage.AggMinOn = 0;
    	    			  temperature_storage.AggCountOn = 0;
    	    			  temperature_storage.AggAvgOn = 0;
    	    			  temperature_storage.AggSumOn = 0;
    	    			  temperature_storage.AggSqSumOn = 0;
    	    			  temperature_storage.condSize = 0;
    	    			  temperature_storage.measurementId = 0;

    	    	          aggPar = nx_json_get(item, "agg");

    	    			  // START AGGREGATOR
    	    			  for (j = 0; j < aggPar->children.length; j++) {
    	    				  const nx_json* item=nx_json_item(aggPar, j);
    	    			      APP_LOG(TS_ON, VLEVEL_L, "ENABLING AGGREGATOR: %s\r\n", item->text_value);

    	    			      if (strcmp((char*)(item->text_value), "MAX") == 0){
    	    			    	  temperature_storage.AggMaxOn = 1;
    	    			      }
    	    			      if (strcmp((char*)(item->text_value), "MIN") == 0){
    	    			    	  temperature_storage.AggMinOn = 1;
    	    			      }
    	    			      if (strcmp((char*)(item->text_value), "COUNT") == 0) {
    	    			    	  temperature_storage.AggCountOn = 1;
    	    			      }
    	    			      if (strcmp((char*)(item->text_value), "AVG") == 0) {
    	    			    	  temperature_storage.AggAvgOn = 1;
    	    			      }
    	    			      if (strcmp((char*)(item->text_value), "SUM") == 0) {
    	    			    	  temperature_storage.AggSumOn = 1;
    	    			      }
    	    			      if (strcmp((char*)(item->text_value), "SQSUM") == 0) {
    	    			    	  temperature_storage.AggSqSumOn = 1;
    	    			      }
    	    			  }

    	    			  // END AGGREGATOR

    	    			  // START EPOCH DURATION

    	    			  epDur = (uint8_t)atoi(nx_json_get(item, "epDur")->text_value);

    	    			  APP_LOG(TS_ON, VLEVEL_L, "REPORTING PERIOD: %d [s]\r\n", epDur);
    	    			  temperature_storage.epDuration = epDur;

    	    			  UTIL_TIMER_Stop(&TxTimer);

    	    			  UTIL_TIMER_Create(&TxTemperatureMeasureTimer,  0xFFFFFFFFU, UTIL_TIMER_ONESHOT, OnMeasureTemperatureTimerEvent, NULL);
    	    			  UTIL_TIMER_SetPeriod(&TxTemperatureMeasureTimer, epDur*1000);
    	    			  UTIL_TIMER_Start(&TxTemperatureMeasureTimer);

    	    			  // END EPOCH DURATION

    	    			  // START CONDITION

    	    			  if (nx_json_get(item, "cond")) {
    	    				condSel = nx_json_get(nx_json_get(item, "cond"), "chain");
    	    				condArr = nx_json_get(nx_json_get(item, "cond"), "agg");

    	    				if ((uint8_t)atoi(condSel->text_value) == AND) {
    	    			    	temperature_storage.condSel = AND;
    	    				}
    	    				if ((uint8_t)atoi(condSel->text_value) == OR) {
    	    				    temperature_storage.condSel = OR;
    	    				}

    	    			    APP_LOG(TS_ON, VLEVEL_L, "ENABLING CONDITION:\r\n");

    	    			    for (j = 0; j < condArr->children.length; j++) {
    	    			    	const nx_json* condItem=nx_json_item(condArr, j);
    	    			    	condVal = nx_json_get(condItem, "val");
    	    			    	condExp = nx_json_get(condItem, "code");
    	    			    	condPar = nx_json_get(condItem, "par");

    	    			    	temperature_storage.aggConditions[j].value = (uint16_t)atoi(condVal->text_value);

    	    			    	APP_LOG(TS_ON, VLEVEL_L, "value: %d\r\n", temperature_storage.aggConditions[j].value);

    	    			      	switch ((uint8_t)atoi(condPar->text_value))
    	    			      	{
    	    			      		case TEMPERATURE:
    	    			      	    	APP_LOG(TS_ON, VLEVEL_L, "parameter: temperature\r\n");
    	    			      	    	temperature_storage.aggConditions[j].parameter = TEMPERATURE;
    	    			      	    	break;
    	    			      	    case PRESSURE:
    	    			      	        APP_LOG(TS_ON, VLEVEL_L, "parameter: pressure\r\n");
    	    			      	      temperature_storage.aggConditions[j].parameter = PRESSURE;
    	    			      	        break;
    	    			      	    case HUMIDITY:
    	    			      	        APP_LOG(TS_ON, VLEVEL_L, "parameter: humidity\r\n");
    	    			      	      temperature_storage.aggConditions[j].parameter = HUMIDITY;
    	    			      	        break;
    	    			      	    default:
    	    			      	       break;
    	    			      	}

    	    			    	if (strcmp((char*)(condExp->text_value), "G") == 0) {
    	    			    		APP_LOG(TS_ON, VLEVEL_L, "code: GREATER\r\n");
    	    			    		temperature_storage.aggConditions[j].condition = GREATER;
    	    			    	}
    	    			    	else if (strcmp((char*)(condExp->text_value), "GE") == 0) {
    	    			    		APP_LOG(TS_ON, VLEVEL_L, "code: GREATER_THAN_EQUAL\r\n");
    	    			    		temperature_storage.aggConditions[j].condition = GREATER_THAN_EQUAL;
    	    			    	}
    	    			    	else if (strcmp((char*)(condExp->text_value), "L") == 0) {
    	    			    		APP_LOG(TS_ON, VLEVEL_L, "code: LESS\r\n");
    	    			    		temperature_storage.aggConditions[j].condition = LESS;
    	    			    	}
    	    			    	else if (strcmp((char*)(condExp->text_value), "LE") == 0) {
    	    			    		APP_LOG(TS_ON, VLEVEL_L, "code: LESS_THAN_EQUAL\r\n");
    	    			    		temperature_storage.aggConditions[j].condition = LESS_THAN_EQUAL;
    	    			    	}
    	    			    	temperature_storage.condSize++;
    	    			    }

