sofiia2002/fernando-levchenko-iot/STM32CubeExpansion_LRWAN_V2.1.0/Projects/B-L072Z-LRWAN1/Applications/LoRaWAN/LoRaWAN_End_Node/LoRaWAN/App/lora_app.c
	}
	/* Collect measurements */
}

static void SendTemperatureMeasurements(void)
{
	int16_t temperature_max = 0;
	int16_t temperature_min = 0;
	int16_t temperature_avg = 0;
	int16_t temperature_count = 0;
	int16_t temperature_sum = 0;
	uint32_t temperature_sqSum = 0;

	sensor_t sensor_data;
	UTIL_TIMER_Time_t nextTxIn = 0;

	uint32_t i = 0;
	int32_t latitude = 0;
	int32_t longitude = 0;
	uint8_t battery = 0;
	uint16_t altitudeGps = 0;
	EnvSensors_Read(&sensor_data);

	if (temperature_storage.AggStateOn == 1 && TempDataOn == 1) {
		APP_LOG(TS_OFF, VLEVEL_L, "\r\n###### ============ SENDING TEMPERATURE TX DATA ============\r\n");

		if (temperature_storage.AggMaxOn == 1) {
			temperature_max = temperature_storage.collectedData.max;
		}
   	    if (temperature_storage.AggMinOn == 1) {
		   temperature_min = temperature_storage.collectedData.min;
		}
		if (temperature_storage.AggAvgOn == 1) {
		   temperature_avg = temperature_storage.collectedData.sum / temperature_storage.collectedData.count;
		}
		if (temperature_storage.AggSumOn == 1) {
		   temperature_sum = temperature_storage.collectedData.sum;
		}
		if (temperature_storage.AggCountOn == 1) {
		   temperature_count = temperature_storage.collectedData.count;
		}
		if (temperature_storage.AggSqSumOn == 1) {
		   temperature_sqSum = temperature_storage.collectedData.sqSum;
		}

		AppData.Port = LORAWAN_USER_APP_PORT;

		AppData.Buffer[i++] = DATA_AGG_ON;
		AppData.Buffer[i++] = TEMPERATURE;
		AppData.Buffer[i++] = temperature_storage.measurementId;
		AppData.Buffer[i++] = temperature_storage.AggMaxOn;
		AppData.Buffer[i++] = temperature_storage.AggMinOn;
		AppData.Buffer[i++] = temperature_storage.AggAvgOn;
		AppData.Buffer[i++] = temperature_storage.AggSumOn;
		AppData.Buffer[i++] = temperature_storage.AggCountOn;
		AppData.Buffer[i++] = temperature_storage.AggSqSumOn;

		if (temperature_storage.AggMaxOn == 1) {
			AppData.Buffer[i++] = (uint8_t)(temperature_max & 0xFF);
			APP_LOG(TS_ON, VLEVEL_L, "temperature max: %d\r\n", (temperature_max));
		}
		if (temperature_storage.AggMinOn == 1) {
			AppData.Buffer[i++] = (uint8_t)(temperature_min & 0xFF);
			APP_LOG(TS_ON, VLEVEL_L, "temperature min: %d\r\n", (temperature_min));
		}
		if (temperature_storage.AggAvgOn == 1) {
			AppData.Buffer[i++] = (uint8_t)(temperature_avg & 0xFF);
			APP_LOG(TS_ON, VLEVEL_L, "temperature avg: %d\r\n", (temperature_avg));
		}
		if (temperature_storage.AggSumOn == 1) {
			AppData.Buffer[i++] = (uint8_t)(temperature_sum & 0xFF);
			APP_LOG(TS_ON, VLEVEL_L, "temperature sum: %d\r\n", (temperature_sum));
		}
		if (temperature_storage.AggCountOn == 1) {
			AppData.Buffer[i++] = (uint8_t)(temperature_count & 0xFF);
			APP_LOG(TS_ON, VLEVEL_L, "temperature count: %d\r\n", (temperature_count));
		}
		if (temperature_storage.AggSqSumOn == 1) {
			AppData.Buffer[i++] = (uint8_t)((temperature_sqSum >> 24) & 0xFF);
			AppData.Buffer[i++] = (uint8_t)((temperature_sqSum >> 16) & 0xFF);
			AppData.Buffer[i++] = (uint8_t)((temperature_sqSum >> 8) & 0xFF);
			AppData.Buffer[i++] = (uint8_t)(temperature_sqSum & 0xFF);
			APP_LOG(TS_ON, VLEVEL_L, "temperature sqsum: %d\r\n", (temperature_sqSum));
		}

		latitude = sensor_data.latitude;
		longitude = sensor_data.longitude;
		battery = GetBatteryLevel();

		AppData.Buffer[i++] = battery;      /* 1 (very low) to 254 (fully charged) */
		AppData.Buffer[i++] = (uint8_t)((latitude >> 16) & 0xFF);
		AppData.Buffer[i++] = (uint8_t)((latitude >> 8) & 0xFF);
		AppData.Buffer[i++] = (uint8_t)(latitude & 0xFF);
		AppData.Buffer[i++] = (uint8_t)((longitude >> 16) & 0xFF);
		AppData.Buffer[i++] = (uint8_t)((longitude >> 8) & 0xFF);
		AppData.Buffer[i++] = (uint8_t)(longitude & 0xFF);
		AppData.Buffer[i++] = (uint8_t)((altitudeGps >> 8) & 0xFF);
		AppData.Buffer[i++] = (uint8_t)(altitudeGps & 0xFF);
		APP_LOG(TS_ON, VLEVEL_L, "battery level: %d\r\n", (battery));
		APP_LOG(TS_ON, VLEVEL_L, "latitude: %d\r\n", (latitude));
		APP_LOG(TS_ON, VLEVEL_L, "longitude: %d\r\n", (longitude));
		APP_LOG(TS_ON, VLEVEL_L, "altitude: %d\r\n", (altitudeGps));
		//  }

		AppData.BufferSize = i;

		if (LORAMAC_HANDLER_SUCCESS == LmHandlerSend(&AppData, LORAWAN_DEFAULT_CONFIRMED_MSG_STATE, &nextTxIn, false))
		{
			APP_LOG(TS_ON, VLEVEL_L, "%d\r\n", (AppData.Buffer));
		    APP_LOG(TS_ON, VLEVEL_L, "SEND REQUEST\r\n");
		}
		else if (nextTxIn > 0)
		{
			APP_LOG(TS_ON, VLEVEL_L, "Next Tx in  : ~%d second(s)\r\n", (nextTxIn / 1000));
		}

		// CLEAN UP

		temperature_storage.measurementId++;
		temperature_storage.collectedData.max = 0;
		temperature_storage.collectedData.min = 0;
		temperature_storage.collectedData.sum = 0;
		temperature_storage.collectedData.count = 0;
		temperature_storage.collectedData.sqSum = 0;
	}

}

static void SendPressureMeasurements(void)
{
	uint16_t pressure = 0;
	uint16_t pressure_max = 0;
	uint16_t pressure_min = 0;
	uint16_t pressure_sum = 0;
	uint32_t pressure_sqSum = 0;
	uint16_t pressure_avg = 0;
	int16_t pressure_count = 0;

	sensor_t sensor_data;
	UTIL_TIMER_Time_t nextTxIn = 0;

	uint32_t i = 0;
	int32_t latitude = 0;
	int32_t longitude = 0;
	uint8_t battery = 0;
	uint16_t altitudeGps = 0;
	EnvSensors_Read(&sensor_data);

	if (pressure_storage.AggStateOn == 1 && PressDataOn == 1) {
		APP_LOG(TS_OFF, VLEVEL_L, "\r\n###### ============ SENDING PRESSURE TX DATA ============\r\n");

		if (pressure_storage.AggMaxOn == 1) {
			pressure_max = pressure_storage.collectedData.max;
		}
	   	if (pressure_storage.AggMinOn == 1) {
	       	pressure_min = pressure_storage.collectedData.min;
		}
		if (pressure_storage.AggAvgOn == 1) {
			pressure_avg = pressure_storage.collectedData.sum / pressure_storage.collectedData.count;
		}
		if (pressure_storage.AggSumOn == 1) {
			pressure_sum = pressure_storage.collectedData.sum;
		}
		if (pressure_storage.AggCountOn == 1) {
			pressure_count = pressure_storage.collectedData.count;
		}
		if (pressure_storage.AggSqSumOn == 1) {
			pressure_sqSum = pressure_storage.collectedData.sqSum;
		}

		AppData.Port = LORAWAN_USER_APP_PORT;

		AppData.Buffer[i++] = DATA_AGG_ON;
		AppData.Buffer[i++] = PRESSURE;
		AppData.Buffer[i++] = pressure_storage.measurementId;
		AppData.Buffer[i++] = pressure_storage.AggMaxOn;
		AppData.Buffer[i++] = pressure_storage.AggMinOn;
		AppData.Buffer[i++] = pressure_storage.AggAvgOn;
		AppData.Buffer[i++] = pressure_storage.AggSumOn;
		AppData.Buffer[i++] = pressure_storage.AggCountOn;
		AppData.Buffer[i++] = pressure_storage.AggSqSumOn;

		if (pressure_storage.AggMaxOn == 1) {
			AppData.Buffer[i++] = (uint8_t)((pressure_max >> 8) & 0xFF);
			AppData.Buffer[i++] = (uint8_t)(pressure_max & 0xFF);
			APP_LOG(TS_ON, VLEVEL_L, "pressure max: %d\r\n", (pressure_max));
		}
		if (pressure_storage.AggMinOn == 1) {
			AppData.Buffer[i++] = (uint8_t)((pressure_min >> 8) & 0xFF);
			AppData.Buffer[i++] = (uint8_t)(pressure_min & 0xFF);
			APP_LOG(TS_ON, VLEVEL_L, "pressure min: %d\r\n", (pressure_min));
		}
		if (pressure_storage.AggAvgOn == 1) {
			AppData.Buffer[i++] = (uint8_t)((pressure_avg >> 8) & 0xFF);
			AppData.Buffer[i++] = (uint8_t)(pressure_avg & 0xFF);
			APP_LOG(TS_ON, VLEVEL_L, "pressure avg: %d\r\n", (pressure_avg));
		}
		if (pressure_storage.AggSumOn == 1) {
			AppData.Buffer[i++] = (uint8_t)((pressure_sum >> 8) & 0xFF);
			AppData.Buffer[i++] = (uint8_t)(pressure_sum & 0xFF);
			APP_LOG(TS_ON, VLEVEL_L, "pressure sum: %d\r\n", (pressure_sum));
		}
		if (pressure_storage.AggCountOn == 1) {
			AppData.Buffer[i++] = (uint8_t)(pressure_count & 0xFF);
			APP_LOG(TS_ON, VLEVEL_L, "pressure count: %d\r\n", (pressure_count));
		}
		if (pressure_storage.AggSqSumOn == 1) {
			AppData.Buffer[i++] = (uint8_t)((pressure_sqSum >> 24) & 0xFF);
			AppData.Buffer[i++] = (uint8_t)((pressure_sqSum >> 16) & 0xFF);
			AppData.Buffer[i++] = (uint8_t)((pressure_sqSum >> 8) & 0xFF);
			AppData.Buffer[i++] = (uint8_t)(pressure_sqSum & 0xFF);
			APP_LOG(TS_ON, VLEVEL_L, "pressure sqsum: %d\r\n", (pressure_sqSum));
		}

		latitude = sensor_data.latitude;
		longitude = sensor_data.longitude;
		battery = GetBatteryLevel();

